def ask(question):
    return input(f"{question}: ")

if ask("Собака короткошерстной породы?") == "да":
    if ask("Рост собаки менее 50 см?") == "да":
        if ask("У собаки короткий хвост?") == "да":
            print("английский бульдог")
        else:
            if ask("У собаки длинные уши?") == "да":
                print("гончая")
            else:
                if ask("У собаки короткое тело?") == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        if ask("Собака весит более 50 кг?") == "да":
            print("датский дог")
        else:
            print("фоксхаунд")
else:
    if ask("Рост собаки менее 50 см?") == "да":
        if ask("У собаки доброжелательный характер?") == "да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
    else:
        if ask("У собаки рост менее 70 см?") == "да":
            if ask("У собаки длинные уши?") == "да":
                print("большой вандейский грифон")
            else:
                print("колли")
        else:
            if ask("Окрас рыжий с белыми отметинами?") == "да":
                print("сенбернар")
            else:
                if ask("Белоснежный окрас?") == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")